
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Очищаем старые движения
	Движения.ДенежныеСредства.Записывать = Истина;
	Движения.ДенежныеСредства.Очистить();

	// Для каждой строки табличной части создаем движение
	Для Каждого СтрокаТЧ Из Остатки Цикл

		Движение = Движения.ДенежныеСредства.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ТекущаяДатаСеанса();
		Движение.Счет = СтрокаТЧ.Счет;
		Движение.КатегорияУчета = Справочники.КатегорииУчета.ВводНачальныхОстатков;
		Движение.Валюта = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаТЧ.Счет, "Валюта");
		Движение.Сумма = СтрокаТЧ.Сумма;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
