#Область ПрограммныйИнтерфейс

// Возвращает курсы валют ЦБ РФ на указанную дату через веб-сервис.
//
// Параметры:
//   ДатаЗагрузки - Дата - дата, на которую требуется получить курсы валют
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица ValuteCursOnDate с курсами валют с полями:
//    Vname - Название валюты
//    Vnom - Номинал
//    Vcurs - Курс
//    Vcode - ISO Цифровой код валюты
//    VchCode - ISO Символьный код валюты
//    VunitRate - Курс за 1 единицу валюты 
Функция ПолучитьКурсВалют(ДатаЗагрузки) Экспорт
	
	//Создаем прокси для обращения к внешнему веб-сервису,
    // передаем в функцию URI пространства имен, имя сервиса, имя порта.
	Прокси = WSСсылки.ЦБ_РФ.СоздатьWSПрокси("http://web.cbr.ru/", "DailyInfo", "DailyInfoSoap");
    
    //Получаем тип параметра, который передается в метод GetCursOnDate.
	ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить("http://web.cbr.ru/").Получить("GetCursOnDate");
    
    //Создаем параметр на основе типа и заполняем значение параметра On_Date.
	WSПараметр = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
	WSПараметр.On_Date = ДатаЗагрузки;
    
    //Вызываем метод веб-сервиса, записываем результат в переменную КурсыВалют.
	КурсыВалют = Прокси.GetCursOnDate(WSПараметр);
	Возврат КурсыВалют.GetCursOnDateResult.diffgram.ValuteData.ValuteCursOnDate;

КонецФункции

// Определяет существование валют в справочнике Валюты.
//
// Параметры:
//  ТаблицаВалют - ТаблицаЗначений - таблица с колонками:
//    * Код - Строка - код валюты
//  В процессе работы добавляется колонка:
//    * Существует - Булево - признак существования валюты в справочнике
//
Процедура ОпределитьСуществованиеВалют(ТаблицаВалют) Экспорт

	КодыВалют = ТаблицаВалют.ВыгрузитьКолонку("Код");
	ТаблицаВалют.Колонки.Добавить("Существует");
	ТаблицаВалют.ЗаполнитьЗначения(Ложь, "Существует");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|    Валюты.Ссылка КАК Ссылка
	|ИЗ
	|    Справочник.Валюты КАК Валюты
	|ГДЕ
	|    Валюты.Код В (&Коды)";

	Запрос.УстановитьПараметр("Коды", КодыВалют);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		СущСтрока = ТаблицаВалют.НайтиСтроку(Выборка.Код, "Vcode");
		Если СущСтрока <> Неопределено Тогда
			СущСтрока.Существует = Истина;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти