#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)

	Если Не ЗначениеЗаполнено(Объект.ДатаЗагрузки) Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Не задана дата загрузки.'"));
		Возврат;
	КонецЕсли;

	ЗагрузитьНаСервере();

КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере()

	ТаблицаДанных = ВзаимодействиеСВалютами.ПолучитьКурсВалют(ТекущаяДатаСеанса());
	ВзаимодействиеСВалютами.ОпределитьСуществованиеВалют(ТаблицаДанных);

	 // Создаем набор записей для регистра
	НаборЗаписей = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();

	Для Каждого Элемент Из ТаблицаДанных Цикл

		Если Не Элемент.Существует Тогда
			Продолжить;
		КонецЕсли;

		 // Создаем новую запись
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоДня(ТекущаяДатаСеанса());
		НоваяЗапись.Валюта = Справочники.Валюты.НайтиПоКоду(Элемент.Vcode);
		НоваяЗапись.Курс = Элемент.Vcurs;
		НоваяЗапись.Номинал = Элемент.Vnom;
		НоваяЗапись.Источник = "ЦБ РФ";

	КонецЦикла;

	Попытка
		НаборЗаписей.Записать();
	Исключение
		ВызватьИсключение (ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

#КонецОбласти