
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    // Получаем переменные
    ТекущаяДата = ТекущаяДатаСеанса();
    ВалютаСписания = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СчетСписания, "Валюта");
    ВалютаЗачисления = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СчетЗачисления, "Валюта");
    
    // Очищаем старые движения
    Движения.ДенежныеСредства.Записывать = Истина;
    Движения.ДенежныеСредства.Очистить();
    
    // Списание с отправителя
    ДвижениеРасход = Движения.ДенежныеСредства.Добавить();
    ДвижениеРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
    ДвижениеРасход.Период = ТекущаяДата;
    ДвижениеРасход.Счет = СчетСписания;
    ДвижениеРасход.КатегорияУчета = Справочники.КатегорииУчета.ПереводМеждуСчетами;
    ДвижениеРасход.Валюта = ВалютаСписания;
    ДвижениеРасход.Сумма = СуммаСписания;
    
    // Поступление получателю
    ДвижениеПриход = Движения.ДенежныеСредства.Добавить();
    ДвижениеПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
    ДвижениеПриход.Период = ТекущаяДата;
    ДвижениеПриход.Счет = СчетЗачисления;
    ДвижениеПриход.КатегорияУчета = Справочники.КатегорииУчета.ПереводМеждуСчетами;
    ДвижениеПриход.Валюта = ВалютаЗачисления; 
    ДвижениеПриход.Сумма = СуммаЗачисления;
    
    // Записываем курс в историю
    Если ВалютаСписания <> ВалютаЗачисления Тогда
        Запись = РегистрыСведений.КурсВнутреннихПереводов.СоздатьМенеджерЗаписи();
        Запись.Период = ТекущаяДата;
        Запись.ВалютаИсточник = ВалютаСписания;
        Запись.ВалютаПриемник = ВалютаЗачисления;
        Запись.Курс = Курс;
        Запись.ДокументОснование = Ссылка;
        Запись.Записать();
    КонецЕсли;
    
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
