
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Очищаем старые движения
	Движения.ДенежныеСредства.Записывать = Истина;
    Движения.ДенежныеСредства.Очистить();
    
    //Добавляем движения по регистру накопления денежные средства
    Движение = Движения.ДенежныеСредства.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = ТекущаяДатаСеанса();
    Движение.Счет = Счет;
    Движение.КатегорияУчета = Категория;
    Движение.Валюта = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Счет, "Валюта");
    Движение.Сумма = Сумма;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
